; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v4)
             (pred_2 ?v8 ?v5)
             (pred_6 ?v10 ?v5)
             (pred_8 ?v13 ?v10 )
	     (pred_3 ?v10)
             (pred_9 ?v12)
             (pred_12 ?v8)
             (pred_10 ?v5)
             (pred_1 ?v10)
             (pred_11 ?v8)
             (pred_5 ?v10)
             (pred_4 ))



(:action op_3
:parameters (?v6 ?v2 ?v3 ?v7)
:precondition (and (pred_9 ?v6) (pred_9 ?v2) (pred_12 ?v3) (pred_10 ?v7)
          (pred_7 ?v6 ?v2) (pred_2 ?v3 ?v7)
                   (pred_6 ?v2 ?v7) (pred_3 ?v6) 
                   (pred_1 ?v2) (pred_11 ?v3))
:effect (and  (pred_5 ?v2) (not (pred_1 ?v2))))


(:action op_4
:parameters (?v6 ?v1)
:precondition (and (pred_9 ?v6) (pred_9 ?v1)
               (pred_3 ?v6) (pred_7 ?v6 ?v1) (pred_5 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v6))))

(:action op_5
:parameters (?v6 ?v3)
:precondition (and (pred_9 ?v6) (pred_12 ?v3) 
                  (pred_3 ?v6) (pred_8 ?v3 ?v6) (pred_4 ))
:effect (and (pred_11 ?v3)
   (not (pred_8 ?v3 ?v6)) (not (pred_4 ))))


(:action op_2
:parameters (?v6 ?v9 ?v11)
:precondition (and (pred_9 ?v6) (pred_12 ?v9) (pred_12 ?v11)
                  (pred_3 ?v6) (pred_11 ?v11) (pred_8 ?v9 ?v6))
:effect (and (pred_11 ?v9) (pred_8 ?v11 ?v6)
        (not (pred_11 ?v11)) (not (pred_8 ?v9 ?v6))))

(:action op_1
:parameters (?v6 ?v3)
:precondition (and (pred_9 ?v6) (pred_12 ?v3) 
                  (pred_3 ?v6) (pred_11 ?v3))
:effect (and (pred_4 ) (pred_8 ?v3 ?v6) (not (pred_11 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_28 obj_14 obj_08 obj_07 obj_09 obj_11 obj_05 obj_12 obj_30 obj_13 obj_23 obj_20 obj_19 obj_04 obj_21 obj_29 obj_25 obj_22 obj_02 obj_01 obj_16 obj_17 obj_10 obj_24
    obj_06 obj_31 obj_27
    obj_03 obj_15 obj_18
    )

    (:init
       (pred_4)

       (pred_9 obj_26)
       (pred_9 obj_28)
       (pred_9 obj_14)
       (pred_9 obj_08)
       (pred_9 obj_07)
       (pred_9 obj_09)
       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_30)
       (pred_9 obj_13)
       (pred_9 obj_23)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_04)
       (pred_9 obj_21)
       (pred_9 obj_29)
       (pred_9 obj_25)
       (pred_9 obj_22)
       (pred_9 obj_02)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_24)
       (pred_10 obj_06)
       (pred_10 obj_31)
       (pred_10 obj_27)
       (pred_12 obj_03)
       (pred_12 obj_15)
       (pred_12 obj_18)

       (pred_7 obj_26 obj_09)
       (pred_7 obj_26 obj_28)
       (pred_7 obj_28 obj_11)
       (pred_7 obj_28 obj_14)
       (pred_7 obj_28 obj_26)
       (pred_7 obj_14 obj_05)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_28)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_07 obj_30)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_09 obj_26)
       (pred_7 obj_11 obj_23)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_28)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_14)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_12 obj_19)
       (pred_7 obj_12 obj_30)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_30 obj_04)
       (pred_7 obj_30 obj_07)
       (pred_7 obj_30 obj_12)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_13 obj_23)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_23 obj_29)
       (pred_7 obj_23 obj_20)
       (pred_7 obj_23 obj_11)
       (pred_7 obj_23 obj_13)
       (pred_7 obj_20 obj_25)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_23)
       (pred_7 obj_19 obj_22)
       (pred_7 obj_19 obj_04)
       (pred_7 obj_19 obj_12)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_30)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_21 obj_29)
       (pred_7 obj_21 obj_13)
       (pred_7 obj_29 obj_16)
       (pred_7 obj_29 obj_25)
       (pred_7 obj_29 obj_23)
       (pred_7 obj_29 obj_21)
       (pred_7 obj_25 obj_17)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_20)
       (pred_7 obj_25 obj_29)
       (pred_7 obj_22 obj_10)
       (pred_7 obj_22 obj_02)
       (pred_7 obj_22 obj_19)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_02 obj_24)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_22)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_16 obj_29)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_25)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_10 obj_24)
       (pred_7 obj_10 obj_22)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_24 obj_02)
       (pred_7 obj_24 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_01)
       (pred_6  obj_09 obj_06)
       (pred_6  obj_21 obj_31)
       (pred_6  obj_01 obj_27)
       (pred_5 obj_26)
       (pred_5 obj_28)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_11)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_30)
       (pred_5 obj_13)
       (pred_5 obj_23)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_04)
       (pred_5 obj_29)
       (pred_5 obj_25)
       (pred_5 obj_22)
       (pred_5 obj_02)
       (pred_5 obj_16)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_5 obj_24)

       (pred_2  obj_03 obj_06)
       (pred_2  obj_15 obj_31)
       (pred_2  obj_18 obj_27)
       (pred_8 obj_03 obj_28)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_18 obj_02)
       (pred_3 obj_20)
    )

    (:goal (and
       (pred_8 obj_15 obj_25)
    ))
(:constraints
  (always (not (pred_3 obj_05)))
)
)

; plan
1. (op_4 obj_20 obj_23)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_23)
   goals met: 0 of 1
2. (op_4 obj_23 obj_11)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_28)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_28)
   goals met: 0 of 1
4. (op_4 obj_28 obj_26)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_26)
   goals met: 0 of 1
5. (op_5 obj_26 obj_15)
   deleted: (pred_8 obj_15 obj_26) (pred_4)
   added: (pred_11 obj_15)
   goals met: 0 of 1
6. (op_4 obj_26 obj_28)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_28)
   goals met: 0 of 1
7. (op_4 obj_28 obj_11)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_11)
   goals met: 0 of 1
8. (op_4 obj_11 obj_23)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_23)
   goals met: 0 of 1
9. (op_4 obj_23 obj_20)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_20)
   goals met: 0 of 1
10. (op_4 obj_20 obj_25)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_25)
   goals met: 0 of 1
11. (op_1 obj_25 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_4) (pred_8 obj_15 obj_25)
   goals met: 1 of 1
